'''
Задача №3458. Дележ яблок - 1

𝑛 школьников делят 𝑘 яблок поровну, неделящийся остаток остается в корзинке.
Сколько яблок достанется каждому школьнику?
'''

n = 3
k = 14

result = k // n
print(result)
